<?
namespace Sale\Handlers\Delivery\Additional\Location;

class Replacement
{
	public static function getLocalityTypes()
	{
		return array(
			'РџРћРЎРЃР›РћРљ Р“РћР РћР”РЎРљРћР“Рћ РўР?РџРђ' => array('РџР“Рў'),
			'РџРћРЎРЃР›РћРљ' => array('Рџ', 'РџРћРЎ', 'РџРћРЎР•Р›РћРљ'),
			'РђРЈР›' => array('РђРЈР›'),
			'РЎР•Р›Рћ' => array('РЎР•Р›Рћ', 'C'),
			'РҐРЈРўРћР ' => array('РҐРЈРўРћР ', 'РҐ'),
			'Р”Р•Р Р•Р’РќРЇ' => array('Р”Р•Р Р•Р’РќРЇ', 'Р”', 'Р”Р•Р '),
			'РЎРўРђРќР?Р¦Рђ' => array('РЎРўРђРќР?Р¦Рђ', 'РЎРў-Р¦Рђ', 'РЎРўРђРќ'),
			'РЎРќРў' => array(),
			'Р”РђР§РќР«Р™ РџРћРЎРЃР›РћРљ' => array(),
			'Р РђР‘РћР§Р?Р™ РџРћРЎРЃР›РћРљ' => array(),
			'РќРђРЎР•Р›РЃРќРќР«Р™ РџРЈРќРљРў' => array(),
			'РњР?РљР РћР РђР™РћРќ' => array(),
			'РЎР›РћР‘РћР”Рђ' => array(),
			'Р–Р?Р›Р РђР™РћРќ' => array(),
			'Р–Р•Р›Р•Р—РќРћР”РћР РћР–РќРђРЇ РЎРўРђРќР¦Р?РЇ' => array(),
			'РџРћР§РўРћР’РћР• РћРўР”Р•Р›Р•РќР?Р•' => array(),
			'РЎР•Р›Р¬РЎРљРћР• РџРћРЎР•Р›Р•РќР?Р•' => array(),
			'РњР•РЎРўР•Р§РљРћ' => array(),
			'РЎР•Р›Р¬РЎРћР’Р•Рў' => array()
		);
	}

	public static function getRegionTypes()
	{
		return array(
			'РћР‘Р›РђРЎРўР¬' => array('РћР‘Р›'),
			'РђР’РўРћРќРћРњРќР«Р™ РћРљР РЈР“' => array('РђРћ', 'РђР’Рў РћРљР РЈР“'),
			'Р Р•РЎРџРЈР‘Р›Р?РљРђ' => array('Р Р•РЎРџ')
		);
	}

	public static function getRegionExceptions()
	{
		return array(
			'Р§РЈР’РђРЁР?РЇ' => 'Р§РЈР’РђРЁРЎРљРђРЇ',
			'РњРћРЎРљР’Рђ' => 'РњРћРЎРљРћР’РЎРљРђРЇ РћР‘Р›РђРЎРўР¬',
			'РЎРђРќРљРў-РџР•РўР•Р Р‘РЈР Р“' => 'Р›Р•РќР?РќР“Р РђР”РЎРљРђРЇ РћР‘Р›РђРЎРўР¬',
			'РЈР”РњРЈР РўР?РЇ' => 'РЈР”РњРЈР РўРЎРљРђРЇ'
		);
	}

	public static function getDistrictTypes()
	{
		return array(
			'Р РђР™РћРќ' => array('Р -Рќ', 'Р -РћРќ')
		);
	}

	public static function getNameRussia()
	{
		return 'Р РћРЎРЎР?РЇ';
	}
}