<?
class CSearchLanguageRu extends CSearchLanguage
{
	public static function GetKeyboardLayout()
	{
		return array(
			"lo" => "С‘          - ".
				"Р№С†СѓРєРµРЅРіС€С‰Р·С…СЉ".
				"С„С‹РІР°РїСЂРѕР»РґР¶СЌ".
				"СЏС‡СЃРјРёС‚СЊР±СЋ ",
			"hi" => "РЃ            ".
				"Р™Р¦РЈРљР•РќР“РЁР©Р—РҐРЄ".
				"Р¤Р«Р’РђРџР РћР›Р”Р–Р­".
				"РЇР§РЎРњР?РўР¬Р‘Р® "
		);
	}
	public static function GetBigrammLetterFreq()
	{
		return array(
		//            Р°    Р±    РІ    Рі    Рґ    Рµ    Р¶    Р·    Рё    Р№    Рє    Р»    Рј    РЅ    Рѕ    Рї    СЂ    СЃ    С‚    Сѓ    С„    С…    С†    С‡    С€    С‰    С‹    СЊ    СЌ    СЋ    СЏ    СЉ    С‘
		"Р°"=>array(   2,  12,  35,   8,  14,   7,   6,  15,   7,   7,  19,  27,  19,  45,   5,  11,  26,  31,  27,   3,   1,  10,   6,   7,  10,   1,null,null,   2,   6,   9,null,   0),
		"Р±"=>array(   5,   0,   0,   0,   0,   9,   1,   0,   6,null,   0,   6,   0,   2,  21,   0,   8,   1,   0,   6,   0,   0,   0,   0,   0,   1,  11,   0,   0,   0,   2,   0,   0),
		"РІ"=>array(  35,   1,   5,   3,   3,  32,   0,   2,  17,   0,   7,  10,   3,   9,  58,   6,   6,  19,   6,   7,   0,   1,   1,   2,   4,   1,  18,   1,   2,   0,   3,   0,   0),
		"Рі"=>array(   7,   0,   0,   0,   3,   3,   0,   0,   5,null,   1,   5,   0,   1,  50,   0,   7,   0,   0,   2,   0,null,null,   0,   0,null,null,   0,   0,   0,null,null,   0),
		"Рґ"=>array(  25,   0,   3,   1,   1,  29,   1,   1,  13,null,   1,   5,   1,  13,  22,   3,   6,   8,   1,  10,   0,   0,   1,   1,   1,   0,   5,   1,   0,   0,   1,   0,   0),
		"Рµ"=>array(   2,   9,  18, 11,   27,   7,   5,  10,   6,  15,  13,  35,  24,  63,   7,  16,  39,  37,  33,   3,   1,   8,   3,   7,   3,   3,null,   0,   1,   1,   2,null,   0),
		"Р¶"=>array(   5,   1,   0,   0,   6,  12,   0,   0,   5,null,   0,   0,   0,   6,   0,   0,   0,   1,   0,   0,   0,null,   0,   0,   0,null,null,   0,   0,   0,null,   0,   0),
		"Р·"=>array(  35,   1,   7,   1,   5,   3,   0,   0,   4,null,   2,   1,   2,   9,   9,   1,   3,   1,   0,   2,   0,null,   0,   0,   0,null,   4,   0,   0,   0,   4,   0,   0),
		"Рё"=>array(   4,   6,  22,   5,  10,  21,   2,  23,  19,  11,  19,  21,  20,  32,   8,  13,  11,  29,  29,   3,   1,  17,   3,  11,   1,   1,null,null,   1,   3,  17,null,   0),
		"Р№"=>array(   1,   1,   4,   1,   3,   0,   1,   2,   4,null,   5,   1,   2,   7,   9,   7,   3,  10,   2,   0,   0,   0,   1,   3,   2,   0,null,null,null,   0,   0,null,null),
		"Рє"=>array(  24,   1,   4,   1,   0,   4,   1,   1,  26,null,   1,   4,   1,   2,  66,   2,  10,   3,   7,  10,   0,   0,   1,   0,   0,null,   0,   0,   0,   0,null,null,   0),
		"Р»"=>array(  25,   1,   1,   1,   1,  33,   2,   1,  36,null,   1,   2,   1,   8,  30,   2,   0,   3,   1,   6,   0,   4,   0,   1,   0,   0,   3,  20,   0,   4,   9,null,   0),
		"Рј"=>array(  18,   2,   4,   1,   1,  21,   1,   2,  23,null,   3,   1,   3,   7,  19,   5,   2,   5,   3,   9,   1,   0,   0,   2,   0,   0,   5,   1,   1,   0,   3,null,   0),
		"РЅ"=>array(  54,   1,   2,   3,   3,  34,   0,   0,  58,   0,   3,   0,   1,  24,  67,   2,   1,   9,   9,   7,   1,   0,   5,   2,   0,   0,  36,   3,   0,   0,   5,   0,   0),
		"Рѕ"=>array(   1,  28,  84,  32,  47,  15,   7,  18,  12,  29,  19,  41,  38,  30,   9,  18,  43,  50,  39,   3,   2,   5,   2,  12,   4,   3,null,null,   2,   3,   2,null,   0),
		"Рї"=>array(   7,   0,   0,null,   0,  15,null,null,   4,null,   0,   9,   0,   1,  46,   0,  41,   1,   0,   6,   0,   0,   0,   0,   0,   0,   2,   0,   0,   0,   2,null,   0),
		"СЂ"=>array(  55,   1,   4,   4,   3,  37,   3,   1,  24,null,   3,   1,   3,   7,  56,   2,   1,   5,   9,  16,   0,   1,   1,   1,   2,   0,   8,   3,   0,   0,   5,   0,   0),
		"СЃ"=>array(   8,   1,   7,   1,   2,  25,   0,   0,   6,null,  40,  13,   3,   9,  27,  11,   4,  11,  82,   6,   0,   1,   1,   2,   2,   0,   1,   8,   0,   0,  17,   0,   0),
		"С‚"=>array(  35,   1,  27,   1,   3,  31,   0,   1,  28,null,   5,   1,   1,  11,  56,   4,  26,  18,   2,  10,   0,   0,   0,   1,   0,   0,  11,  21,   0,   0,   4,   0,   0),
		"Сѓ"=>array(   1,   4,   4,   4,  11,   2,   6,   3,   2,   0,   8,   5,   5,   5,   1,   5,   7,  14,   7,   0,   0,   1,   0,   8,   3,   2,null,null,   0,   9,   1,null,   0),
		"С„"=>array(   2,   0,   0,   0,   0,   2,null,   0,   2,null,   0,   0,   0,   0,   1,   0,   1,   1,   0,   0,   0,null,null,   0,   0,   0,   0,   0,   0,   0,   0,null,   0),
		"С…"=>array(   4,   1,   4,   1,   3,   1,   0,   2,   3,null,   4,   3,   3,   4,  18,   5,   3,   4,   2,   2,   1,   0,   0,   1,   0,   0,null,   0,   0,null,null,   0,null),
		"С†"=>array(   3,   0,   0,   0,   0,   7,null,   0,  10,null,   2,   0,   0,   0,   1,   0,   0,   0,   0,   1,null,null,   0,null,   0,null,   1,   0,null,   0,null,null,null),
		"С‡"=>array(  12,   0,   0,null,   0,  23,   0,null,  13,null,   2,   0,   0,   6,   0,null,   0,   0,   7,   1,null,   0,   0,   0,   1,null,   0,   1,null,null,   0,null,   0),
		"С€"=>array(   5,   0,   0,null,null,  11,null,null,  14,null,   1,   2,   0,   2,   2,   0,   0,   0,   0,   1,   0,   0,   0,   0,null,null,null,   1,null,   0,null,null,   0),
		"С‰"=>array(   3,null,   0,null,null,   8,null,null,   6,null,null,null,   0,   1,   0,null,   0,null,null,   1,null,null,null,null,null,null,null,   0,null,null,null,null,   0),
		"С‹"=>array(null,   1,   9,   1,   3,  12,   0,   2,   4,   7,   3,   6,   6,   3,null,  10,   3,   9,   4,   1,null,  16,   0,   1,   2,   0,null,null,null,null,   0,null,null),
		"СЊ"=>array(   0,   2,   4,   1,   1,   2,   0,   2,   2,null,   6,   0,   3,  13,   2,   4,   1,  11,   3,null,   0,   0,   0,   1,   4,   0,null,null,   1,   3,   1,null,   0),
		"СЌ"=>array(   0,   0,   0,   0,   0,null,   0,   0,null,   0,   1,   0,   0,   1,   0,   0,   0,   1,   9,   0,   0,   0,   0,null,   0,null,null,null,null,   0,   0,null,null),
		"СЋ"=>array(   0,   2,   1,   2,   1,   0,   0,   3,   1,   0,   1,   0,   1,   1,   1,   3,   1,   1,   7,null,   0,   0,   1,   1,   0,   4,null,null,   0,   0,   0,null,   0),
		"СЏ"=>array(   1,   3,   9,   1,   3,   3,   1,   5,   3,   2,   3,   3,   4,   6,   3,   6,   3,   6,  10,   0,   0,   2,   1,   4,   1,   1,null,null,   1,   1,   1,null,null),
		"СЉ"=>array(null,null,null,null,null,   0,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,   0,   0,null,   0),
		"С‘"=>array(null,   0,   0,   0,   0,null,   0,   0,null,null,   0,   0,   0,   0,null,   0,   0,   0,   0,null,null,   0,   0,   0,   0,   0,null,null,null,null,null,null,null),
		);
	}
}
?>
