<?
namespace Bitrix\Sale\Location\Comparator;

class Replacement
{
	public static function getLocalityTypes()
	{
		return array(
			'РџРћРЎРЃР›РћРљ Р“РћР РћР”РЎРљРћР“Рћ РўР?РџРђ' => array('РџР“Рў'),
			'РџРћРЎРЃР›РћРљ' => array('Рџ', 'РџРћРЎ', 'РџРћРЎР•Р›РћРљ'),
			'РђРЈР›' => array(),
			'РЎР•Р›Рћ' => array('C'),
			'РҐРЈРўРћР ' => array('РҐ'),
			'Р”Р•Р Р•Р’РќРЇ' => array('Р”', 'Р”Р•Р '),
			'РЎРўРђРќР?Р¦Рђ' => array('РЎРў-Р¦Рђ', 'РЎРўРђРќ'),
			'Р РђР‘РћР§Р?Р™ РџРћРЎРЃР›РћРљ' => array()
		);
	}

	public static function getRegionTypes()
	{
		return array(
			'РћР‘Р›РђРЎРўР¬' => array('РћР‘Р›'),
			'РђР’РўРћРќРћРњРќР«Р™ РћРљР РЈР“' => array('РђРћ', 'РђР’Рў РћРљР РЈР“'),
			'Р Р•РЎРџРЈР‘Р›Р?РљРђ' => array('Р Р•РЎРџ')
		);
	}

	public static function getRegionVariants()
	{
		return array(
			'Р§РЈР’РђРЁР?РЇ' => 'Р§РЈР’РђРЁРЎРљРђРЇ',
			'РњРћРЎРљР’Рђ' => 'РњРћРЎРљРћР’РЎРљРђРЇ РћР‘Р›РђРЎРўР¬',
			'РЎРђРќРљРў-РџР•РўР•Р Р‘РЈР Р“' => 'Р›Р•РќР?РќР“Р РђР”РЎРљРђРЇ РћР‘Р›РђРЎРўР¬',
			'РЈР”РњРЈР РўР?РЇ' => 'РЈР”РњРЈР РўРЎРљРђРЇ',
			'РЎРђРҐРђ /РЇРљРЈРўР?РЇ/ Р Р•РЎРџ' => 'Р Р•РЎРџРЈР‘Р›Р?РљРђ РЎРђРҐРђ (РЇРљРЈРўР?РЇ)',
			'РҐРђРќРўР«-РњРђРќРЎР?Р™РЎРљР?Р™ РђР’РўРћРќРћРњРќР«Р™ РћРљР РЈР“ - Р®Р“Р Рђ РђРћ' => 'РҐРђРќРўР«-РњРђРќРЎР?Р™РЎРљР?Р™ РђР’РўРћРќРћРњРќР«Р™ РћРљР РЈР“',
			'Р•Р’Р Р•Р™РЎРљРђРЇ РђРћР‘Р›' => 'Р•Р’Р Р•Р™РЎРљРђРЇ РђР’РўРћРќРћРњРќРђРЇ РћР‘Р›РђРЎРўР¬'
		);
	}

	public static function getCountryVariants()
	{
		return array(
			'Р Р¤' => 'Р РћРЎРЎР?РЇ',
			'Р РћРЎРЎР?Р™РЎРљРђРЇ Р¤Р•Р”Р•Р РђР¦Р?РЇ' => 'Р РћРЎРЎР?РЇ'
		);
	}

	public static function isCountryRussia($countryName)
	{
		return in_array(
			ToUpper(
				trim(
					$countryName
				)
			),
			array(
				'Р Р¤',
				'Р РћРЎРЎР?Р™РЎРљРђРЇ Р¤Р•Р”Р•Р РђР¦Р?РЇ',
				'Р РћРЎРЎР?РЇ'
			)
		);
	}

	public static function getDistrictTypes()
	{
		return array(
			'Р РђР™РћРќ' => array('Р -Рќ', 'Р -РћРќ')
		);
	}
}